HasanBasriBILGE/STM32F401RE_Bootloader/STM32F401RE_Bootloader/Core/Src/main.c
			HAL_FLASH_OB_Lock();
    }

		return 0;
}

uint8_t execute_mem_write(uint8_t *pBuffer, uint32_t mem_address, uint32_t len)
{
    uint8_t status=HAL_OK;

    //We have to unlock flash module to get control of registers
    HAL_FLASH_Unlock();

    for(uint32_t i = 0 ; i <len ; i++)
    {
        //Here we program the flash byte by byte
        status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_BYTE,mem_address+i,pBuffer[i] );
    }

    HAL_FLASH_Lock();

    return status;
}


uint8_t execute_flash_erase(uint8_t sector_number , uint8_t number_of_sector)
{
	FLASH_EraseInitTypeDef flashErase_handle;
	uint32_t sectorError;
	HAL_StatusTypeDef status;


	if( number_of_sector > 7 )
		return INVALID_SECTOR;

	if( (sector_number == 0xff ) || (sector_number <= 7) )
	{
		if(sector_number == (uint8_t) 0xff)
		{
			flashErase_handle.TypeErase = FLASH_TYPEERASE_MASSERASE;
		}else
		{
		    /*Here we are just calculating how many sectors needs to erased */
			uint8_t remanining_sector = 8 - sector_number;
            if( number_of_sector > remanining_sector)
            {
            	number_of_sector = remanining_sector;
            }
			flashErase_handle.TypeErase = FLASH_TYPEERASE_SECTORS;
			flashErase_handle.Sector = sector_number; // this is the initial sector
			flashErase_handle.NbSectors = number_of_sector;
		}
		flashErase_handle.Banks = FLASH_BANK_1;

		/*Get access to touch the flash registers */
		HAL_FLASH_Unlock();
		flashErase_handle.VoltageRange = FLASH_VOLTAGE_RANGE_3;  // our mcu will work on this voltage range
		status = (uint8_t) HAL_FLASHEx_Erase(&flashErase_handle, &sectorError);
		HAL_FLASH_Lock();

		return status;
	}


	return INVALID_SECTOR;
}

uint8_t verify_address(uint32_t go_address)
{
	if ( go_address >= SRAM1_BASE && go_address <= SRAM1_END)
		{
			return ADDR_VALID;
		}
		else if ( go_address >= FLASH_BASE && go_address <= FLASH_END)
		{
			return ADDR_VALID;
		}else
			return ADDR_INVALID;
}

uint8_t get_flash_rdp_level(void)
{
	uint8_t rdp_status=0;
#if 0
	FLASH_OBProgramInitTypeDef ob_handle;
	HAL_FLASHEx_OBGetConfig(&ob_handle);
	rdp_status = (uint8_t)ob_handle.RDPLevel;

#else
	volatile uint32_t *pOB_addr = (uint32_t *) 0x1FFFC000;
	rdp_status = (uint8_t)(*pOB_addr >> 8);

#endif
	return rdp_status;
}

uint16_t get_mcu_chip_id(void)
{
	uint16_t cid;
	cid = (uint16_t)(DBGMCU ->IDCODE) & 0x0FFF;
	return cid;
}

void bootloader_uart_read_data(void)
{
	uint8_t rcv_len=0;
	while(1)
	{
		memset(bl_rx_buffer,0,200);

		HAL_UART_Receive(&huart1, bl_rx_buffer, 1, HAL_MAX_DELAY);
		rcv_len = bl_rx_buffer[0];
		HAL_UART_Receive(&huart1, &bl_rx_buffer[1], rcv_len, HAL_MAX_DELAY);
		switch(bl_rx_buffer[1])
		{
					case BL_GET_VER:
		                bootloader_handle_getver_cmd(bl_rx_buffer);
		                break;
		            case BL_GET_HELP:
		                bootloader_handle_gethelp_cmd(bl_rx_buffer);
		                break;
		            case BL_GET_CID:
		                bootloader_handle_getcid_cmd(bl_rx_buffer);
		                break;
		            case BL_GET_RDP_STATUS:
		                bootloader_handle_getrdp_cmd(bl_rx_buffer);
		                break;
		            case BL_GO_TO_ADDR:
		                bootloader_handle_go_cmd(bl_rx_buffer);
		                break;
		            case BL_FLASH_ERASE:
		                bootloader_handle_flash_erase_cmd(bl_rx_buffer);
		                break;
		            case BL_MEM_WRITE:
		                bootloader_handle_mem_write_cmd(bl_rx_buffer);
		                break;
		            case BL_EN_RW_PROTECT:
		                bootloader_handle_en_rw_protect(bl_rx_buffer);
		                break;
		            case BL_MEM_READ:
		                bootloader_handle_mem_read(bl_rx_buffer);
		                break;
		            case BL_READ_SECTOR_P_STATUS:
		                bootloader_handle_read_sector_protection_status(bl_rx_buffer);
		                break;
		            case BL_OTP_READ:
		                bootloader_handle_read_otp(bl_rx_buffer);
		                break;
								case BL_DIS_R_W_PROTECT:
		                bootloader_handle_dis_rw_protect(bl_rx_buffer);
		                break;
		             default:
		                printmsg("BL_DEBUG_MSG:Invalid command code received from host \n");
		                break;
		}
	}
}

void bootloader_jump_to_user_app(void)
{
	void (*app_reset_handler)(void);
	printmsg("BL_DEBUG_MSG: bootloader_jump_to_user_app\n\r");

	uint32_t msp_value = *(volatile uint32_t *)FLASH_SECTOR2_BASE_ADDRESS;
	printmsg("BL_DEBUG_MSG: MSP value : %#x\n\r",msp_value);

	__set_MSP(msp_value);

	uint32_t resethandler_address = *(volatile uint32_t *)(FLASH_SECTOR2_BASE_ADDRESS + 4);
	app_reset_handler = (void *)resethandler_address;
	printmsg("BL_DEBUG_MSG: app reset handler addr : %#x\n\r", app_reset_handler);
	app_reset_handler();
}

void printmsg(char *format,...)
{
#ifdef BL_DEBUG_MSG_EN
	char str[80];

	va_list args;
	va_start(args, format);
	vsprintf(str, format, args);
	HAL_UART_Transmit(&huart2, (uint8_t *)str, strlen(str), HAL_MAX_DELAY);
	va_end(args);
#endif
}

void bootloader_send_nack(void)
{
	uint8_t nack = BL_NACK;
	HAL_UART_Transmit(&huart1, &nack, 1, HAL_MAX_DELAY);
}

void bootloader_send_ack(uint8_t command_code, uint8_t follow_len)
{
	uint8_t ack_buf[2];
	ack_buf[0] = BL_ACK;
	ack_buf[1] = follow_len;
	HAL_UART_Transmit(&huart1, ack_buf, 2, HAL_MAX_DELAY);
}

void bootloader_uart_write_data(uint8_t *pBuffer,uint32_t len)
{
	HAL_UART_Transmit(&huart1, pBuffer, len, HAL_MAX_DELAY);
}

uint8_t bootloader_verify_crc (uint8_t *pData, uint32_t len,uint32_t crc_host)
{
	uint32_t uwCRCValue=0xff;
	for (uint32_t i=0 ; i < len ; i++)
	{
		uint32_t i_data = pData[i];
		uwCRCValue = HAL_CRC_Accumulate(&hcrc, &i_data, 1);
	}
	if (uwCRCValue == crc_host)
	{
		return VERIFY_CRC_SUCCESS;
	}

	return VERIFY_CRC_FAIL;
}

uint8_t get_bootloader_version(void)
{
	return (uint8_t)BL_VERSION;
}

void bootloader_handle_getver_cmd(uint8_t *bl_rx_buffer)
{
	uint8_t bl_version;
	printmsg("BL_DEBUG_MSG:bootloader_handle_getver_cmd\n\r");

	uint32_t command_packet_len = bl_rx_buffer[0]+1;
	uint32_t host_crc = *((uint32_t *)(bl_rx_buffer+command_packet_len - 4));

