HasanBasriBILGE/STM32F401RE_Bootloader/STM32F401RE_Bootloader/Core/Src/main.c
	if (!bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG:checksum succes!\n\r");
		bootloader_send_ack(bl_rx_buffer[0],1);
		bl_version=get_bootloader_version();
		printmsg("BL_DEBUG_MSG:BL_VER : %d %#x\n\r",bl_version,bl_version);
		bootloader_uart_write_data(&bl_version,1);
	}else
	{
		printmsg("BL_DEBUG_MSG:checksum fail \n\r");
		bootloader_send_nack();
	}
}

void bootloader_handle_gethelp_cmd(uint8_t *pBuffer)
{
	printmsg("BL_DEBUG_MSG:bootloader_handle_gethelp_cmd\n\r");
	uint32_t command_packet_len = bl_rx_buffer[0]+1;
	uint32_t host_crc = *((uint32_t *)(bl_rx_buffer + command_packet_len -4));

	if (!bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
		{
			printmsg("BL_DEBUG_MSG:checksum succes!\n\r");
			bootloader_send_ack(bl_rx_buffer[0],sizeof(supported_commands));
			bootloader_uart_write_data(supported_commands,sizeof(supported_commands));
		}else
		{
			printmsg("BL_DEBUG_MSG:checksum fail \n\r");
			bootloader_send_nack();
		}

}

void bootloader_handle_getcid_cmd(uint8_t *pBuffer)
{
	uint16_t bl_cid_num =0;
	printmsg("BL_DEBUG_MSG:bootloader_handle_getcid_cmd\n\r");

	uint32_t command_packet_len = bl_rx_buffer[0] +1;
	uint32_t host_crc = *((uint32_t *)(bl_rx_buffer + command_packet_len -4));

	if (!bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
			{
				printmsg("BL_DEBUG_MSG:checksum succes!\n\r");
				bootloader_send_ack(bl_rx_buffer[0],2);
				bl_cid_num = get_mcu_chip_id();
				printmsg("BL_DEBUG_MSG:MCU id : %d %#x !!\n\r", bl_cid_num, bl_cid_num);
				bootloader_uart_write_data((uint8_t *)&bl_cid_num,2);
			}else
			{
				printmsg("BL_DEBUG_MSG:checksum fail \n\r");
				bootloader_send_nack();
			}

}

void bootloader_handle_getrdp_cmd(uint8_t *pBuffer)
{
	uint8_t rdp_level = 0x00;
	printmsg("BL_DEBUG_MSG:bootloader_handle_getrdp_cmd\n\r");

	uint32_t command_packet_len = bl_rx_buffer[0] +1;
	uint32_t host_crc = *((uint32_t *)(bl_rx_buffer + command_packet_len -4));

	if (!bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
			{
				printmsg("BL_DEBUG_MSG:checksum succes!\n\r");
				bootloader_send_ack(bl_rx_buffer[0],1);
				rdp_level = get_flash_rdp_level();
				printmsg("BL_DEBUG_MSG:RDP Level : %d %#x !!\n\r", rdp_level, rdp_level);
				bootloader_uart_write_data(&rdp_level,1);
			}else
			{
				printmsg("BL_DEBUG_MSG:checksum fail \n\r");
				bootloader_send_nack();
			}
}

void bootloader_handle_go_cmd(uint8_t *pBuffer)
{
	uint32_t go_address = 0;
	uint8_t addr_valid = ADDR_VALID;
	uint8_t addr_invalid = ADDR_INVALID;

	printmsg("BL_DEBUG_MSG:bootloader_handle_go_cmd\n\r");

	uint32_t command_packet_len = bl_rx_buffer[0] +1;
	uint32_t host_crc = *((uint32_t *)(bl_rx_buffer + command_packet_len -4));

	if (!bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
			{
				printmsg("BL_DEBUG_MSG:checksum succes!\n\r");
				bootloader_send_ack(bl_rx_buffer[0],1);

				go_address = *((uint32_t *)&bl_rx_buffer[2]);
				printmsg("BL_DEBUG_MSG:GO addr : %#x !!\n\r", go_address);

				if (verify_address(go_address) == ADDR_VALID)
				{
					bootloader_uart_write_data(&addr_valid,1);

					go_address +=1;
					void (*lets_jump)(void) = (void *)go_address;
					printmsg("BL_DEBUG_MSG: jumping to go address! \n\r");

					lets_jump();

				}else{
					printmsg("BL_DEBUG_MSG: GO addr invalid ! \n\r");
					bootloader_uart_write_data(&addr_invalid, 1);
				}
			}else
			{
				printmsg("BL_DEBUG_MSG:checksum fail \n\r");
				bootloader_send_nack();
			}
}

void bootloader_handle_flash_erase_cmd(uint8_t *pBuffer)
{
    uint8_t erase_status = 0x00;
    printmsg("BL_DEBUG_MSG:bootloader_handle_flash_erase_cmd\n");

    //Total length of the command packet
	uint32_t command_packet_len = bl_rx_buffer[0]+1 ;

	//extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t * ) (bl_rx_buffer+command_packet_len - 4) ) ;

	if (! bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
	{
        printmsg("BL_DEBUG_MSG:checksum success !!\n");
        bootloader_send_ack(pBuffer[0],1);
        printmsg("BL_DEBUG_MSG:initial_sector : %d  no_ofsectors: %d\n",pBuffer[2],pBuffer[3]);

        HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,1);
        erase_status = execute_flash_erase(pBuffer[2] , pBuffer[3]);
        HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,0);

        printmsg("BL_DEBUG_MSG: flash erase status: %#x\n",erase_status);

        bootloader_uart_write_data(&erase_status,1);

	}else
	{
        printmsg("BL_DEBUG_MSG:checksum fail !!\n");
        bootloader_send_nack();
	}
}

void bootloader_handle_mem_write_cmd(uint8_t *pBuffer)
{
	uint8_t write_status = 0x00;

	uint8_t payload_len = bl_rx_buffer[6];

	uint32_t mem_address = *((uint32_t *) ( &bl_rx_buffer[2]) );


    printmsg("BL_DEBUG_MSG:bootloader_handle_mem_write_cmd\n");

    //Total length of the command packet
	uint32_t command_packet_len = bl_rx_buffer[0]+1 ;

	//extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t * ) (bl_rx_buffer+command_packet_len - 4) ) ;


	if (! bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
	{
        printmsg("BL_DEBUG_MSG:checksum success !!\n");

        bootloader_send_ack(bl_rx_buffer[0],1);

        printmsg("BL_DEBUG_MSG: mem write address : %#x\n",mem_address);

		if( verify_address(mem_address) == ADDR_VALID )
		{

            printmsg("BL_DEBUG_MSG: valid mem write address\n");

            //glow the led to indicate bootloader is currently writing to memory
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, 1);

            //execute mem write
            write_status = execute_mem_write(&bl_rx_buffer[7],mem_address, payload_len);

            //turn off the led to indicate memory write is over
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, 0);

            //inform host about the status
            bootloader_uart_write_data(&write_status,1);

		}else
		{
            printmsg("BL_DEBUG_MSG: invalid mem write address\n");
            write_status = ADDR_INVALID;
            //inform host that address is invalid
            bootloader_uart_write_data(&write_status,1);
		}


